### Configuration de la connexion à la base de données et fonction d’exécution de requêtes SQL

In [6]:
import pandas as pd
from sqlalchemy import create_engine,text

engine = create_engine("postgresql://postgres:123@localhost:5432/Scaping_Data2")

def run_query(query):
    with engine.connect() as conn:
        df = pd.read_sql_query(text(query), conn)
    return df

### Top 10 des meilleurs buteurs

In [ ]:
top_buteurs = run_query("""
SELECT nomjoueur, SUM(buts) AS total_buts
FROM StatistiqueJoueur
JOIN Joueur USING(id_joueur)
GROUP BY nomjoueur
ORDER BY total_buts DESC
LIMIT 10;
""")

In [12]:
top_buteurs.head(10)

              nomjoueur  total_buts
0         Mohamed Salah          29
1        Alexander Isak          23
2        Erling Haaland          22
3            Chris Wood          20
4          Bryan Mbeumo          20
5           Yoane Wissa          19
6         Ollie Watkins          16
7         Matheus Cunha          15
8           Cole Palmer          15
9  Jørgen Strand Larsen          14

### Joueurs les plus décisifs (buts + passes)

In [30]:
joueurs_decisifs = run_query("""
SELECT nomjoueur, SUM(buts + passesdecisives) AS impact
FROM StatistiqueJoueur
JOIN Joueur USING(id_joueur)
GROUP BY nomjoueur
ORDER BY impact DESC
""")

In [33]:
joueurs_decisifs.head(10)

        nomjoueur  impact
0   Mohamed Salah      47
1  Alexander Isak      29
2    Bryan Mbeumo      27
3  Erling Haaland      25
4   Ollie Watkins      24
5      Chris Wood      23
6     Cole Palmer      23
7     Yoane Wissa      23
8    Jarrod Bowen      21
9   Matheus Cunha      21

### Joueurs les plus disciplinés (cartons)

In [34]:
joueurs_disciplinés = run_query("""
SELECT nomjoueur, SUM(cartonsjaunes + cartonsrouges) AS total_cartons
FROM StatistiqueJoueur
JOIN Joueur USING(id_joueur)
GROUP BY nomjoueur
ORDER BY total_cartons ASC
""")

In [35]:
joueurs_disciplinés.head(700)

              nomjoueur  total_cartons
0            Vitor Reis              0
1           Rob Holding              0
2           Maeson King              0
3               Willian              0
4      Henry Cartwright              0
..                  ...            ...
680          Liam Delap             12
681        Flynn Downes             12
682  Morgan Gibbs-White             12
683          Saša Lukić             12
684          João Gomes             12

[685 rows x 2 columns]

### Répartition des nationalités par équipe

In [36]:
nationalites_par_equipe = run_query("""
SELECT id_equipe, nationalite, COUNT(*) AS nb_joueurs
FROM Joueur
GROUP BY id_equipe, nationalite
ORDER BY id_equipe, nb_joueurs DESC;
""")

In [37]:
nationalites_par_equipe.head(10)

   id_equipe nationalite  nb_joueurs
0          1         ENG          11
1          1         NED           3
2          1         ARG           1
3          1         SCO           1
4          1         COL           1
5          1         URU           1
6          1         ITA           1
7          1         FRA           1
8          1         NIR           1
9          1         HUN           1

### Nombre total de buts par équipe

In [38]:
buts_par_equipe = run_query("""
SELECT id_equipe, SUM(butsmarques) AS total_buts
FROM ResultatMatch
GROUP BY id_equipe
ORDER BY total_buts DESC;
""")

In [39]:
buts_par_equipe.head(10)

   id_equipe  total_buts
0          1         123
1          4         120
2          3         114
3          2         112
4         17         105
5         15          99
6          6          93
7          5          88
8          8          83
9         12          74